Revit 2026 API

# ContextMenuAddItem Method

---

Add an item to the Context Menu.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddItem(
	MenuItem menuItem
)
```
```vb
Public Sub AddItem (
	menuItem As MenuItem
)
```
```cpp
public:
void AddItem(
	MenuItem^ menuItem
)
```
```fsharp
member AddItem :
        menuItem : MenuItem -> unit
```

#### Parameters

menuItem MenuItem

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Use this method to add a specific type of MenuItem object to context menu.

#### Reference

ContextMenu Class

Autodesk.Revit.UI Namespace